<template>
	<view class="uni-padding-wrap">
		  <u-parse :content="content"></u-parse>
	</view>

</template>

<script>
	import uParse from '@/components/u-parse/u-parse.vue'
	import marked from 'marked'
	
	const text = marked(`
	<div style="margin: 12px 0 24px;font-weight:bold;font-size: 18px;text-align: center;">信迷用户隐私政策</div>

本隐私政策将帮助您了解以下内容：

一、个人信息定义及范围

二、我们拥有的权限及对您个人信息的收集使用

三、我们如何保护和管理您的个人信息

四、您的权利

五、我们如何处理儿童的个人信息

六、您的个人信息如何在全球范围转移

七、本隐私政策如何更新

八、争议解决

九、如何联系我们

#### 一、个人信息定义及范围

（一）个人信息：指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。
（二）个人敏感信息：指包括身份证件号码、个人生物识别信息、银行账号、财产信息、行踪轨迹、交易信息、14岁以下（含）儿童信息等个人信息。

#### 二、我们拥有的权限及对您个人信息的收集使用

  我们仅会在合法、正当、必要的前提下收集、使用您的信息，在您使用我们的产品及/或服务时，我们需要/可能需要收集和使用您的个人信息的场景仅包括：为实现向您提供我们产品及/或服务的基本功能，您须授权我们收集、使用的必要信息。如您拒绝提供相应的信息，您将无法正常使用我们的产品及/或服务。：

 1.您充分理解并同意继续使用本软件的服务，本软件会获取您如下权限：

  1.)获取相册和摄像头权限，此权限用于您上传头像时使用；
  2.)获取读取短信权限，此权限在获取短信验证码后自动帮用户填写时需要；
  3.)获取写入外置存储器权限，此权限在更换头像、发布评论等上传图片场景时需要；
  4.)获取拨打电话权限，此权限在拨打联系人电话时需要；

 2.征得授权的例外根据相关法律法规规定及国家标准，以下情形中，我们可能会依法收集并使用您的个人信息无需征得您的同意：
 1)与国家安全、国防安全直接相关的；
 2)与公共安全、公共卫生、重大公共利益直接相关的；
 3)与犯罪侦查、起诉、审判和判决执行等直接相关的；
 4)出于维护您或其他个人的生命、财产等重大合法权益但又很难得到您本人同意的；
 5)所收集的个人信息是您自行向社会公众公开的；
 6)从合法公开披露的信息中收集个人信息的，如：合法的新闻报道、政府信息公开等渠道；
 7)根据您的要求签订和履行合同所必须的；
 8)用于维护所提供的产品或服务的安全稳定运行所必需的，例如发现或处置产品或服务的故障；
 9)法律法规规定的其他情形。 

 3.其他
  若您提供的信息中含有其他用户的个人信息，在向我们提供这些个人信息前，请您确保您已经取得合法的授权。若其中涉及儿童个人信息的，您需要在提供前征得对应儿童监护人的同意。
  若我们将信息用于本协议未载明的其他用途，或者将基于特定目的收集而来的信息用于其他目的，或者我们主动从第三方处获取您的信息，均会事先得到您的同意。  

#### 三、我们如何保护和管理您的个人信息

尊重个人隐私是信迷的责任，当您确认并同意本协议使用我们的产品或服务时，为了保护您的个人隐私，信迷采取以下方式对您的个人信息进行保护和管理：

1、我们已采取符合业内标准、合理可行的安全防护措施保护您的个人信息，防止个人信息遭到未经授权访问、公开披露、使用、修改。我们会使用加密技术提高个人信息的安全性；我们会使用受信赖的保护机制防止个人信息遭到恶意攻击；我们会部署访问控制机制，尽力确保只有授权人员才可访问个人信息;我们会采取SSL的方式在数据交换时进行加密保护；我们也会对相应的网址采取https的安全浏览方式；以及我们会举办安全和隐私保护培训课程，加强员工对于保护个人信息重要性的认识。

2、我们已经按照网络安全等级保护三级的要求完成测试要求并取得备案。

3、我们会采取合理可行的措施，尽力避免收集无关的个人信息。我们只会在达成本协议所述目的所需的期限内保留您的个人信息，除非法律有强制的存留要求。

4、信迷在未经用户授权时不得向第三方公开、编辑或透露用户个人资料的内容，但由于政府要求、法律协议需要等原因除外。在用户发送信息的过程中和本公司收到信息后，本公司将遵守行业通用的标准来保护用户的私人信息。

5、当我们的产品或服务发生停止运营的情形时，我们将以推送通知、公告等形式通知您，并在合理的期限内删除您的个人信息或进行匿名化处理。

#### 四、您的权利

按照中国相关的法律、法规、标准，以及其他国家、地区的通行做法，我们保障您对自己的个人信息行使以下权利：

1.访问权：您有权访问您的个人信息，法律法规规定的例外情况除外。如果您想行使数据访问权，可以通过以下方式自行访问：
账户信息——如果您希望访问或编辑您的账户中的个人资料信息、更改您的密码或关闭您的账户等，您可以通过访问 信迷APP-->我的-->个人资料板块执行此类操作。

#### 五、我们如何处理儿童的个人信息

对于经父母同意而收集儿童个人信息的情况，我们只会在受到法律允许、父母或监护人明确同意或者保护儿童所必要的情况下使用或公开披露此信息。
如果我们发现自己在获得可证实的父母不同意的情况下收集了儿童的个人信息，则会设法尽快删除相关数据。

#### 六、您的个人信息如何在全球范围转移

我们在中华人民共和国境内运营中收集和产生的个人信息，存储在中国境内，法律法规有明确规定/获得您的明确授权的除外。

#### 七、本隐私政策如何更新

我们的隐私协议可能会发生变更。

本政策为《信迷APP用户协议》的重要组成部分。我们保留不时更新或修改本政策的权利。如果该等修改造成您在本政策下权利的实质减少（即“重大变更”），我们会通过不同渠道向您发送变更通知，包括但不限于客户端公示、页面交互、弹窗、短信等等方式。

若您不同意修改后的隐私政策，您有权并应立即停止使用信迷APP的服务。如果您继续使用我们的服务，则视为您接受我们对本政策相关条款所做的修改。

信迷APP的所有服务均适用本政策。但某些服务有其特定的隐私政策，该等特定的隐私政策更具体地说明信迷APP在该服务中如何处理您的信息。如本政策与特定服务的隐私政策有不一致之处，请以该特定隐私政策为准。

本政策所指的重大变更包括但不限于：

我们的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息类型、个人信息的使用方式等；

我们在所有权结构、组织架构等方面发生重大变化。如业务调整、破产并购等引起的所有者变更等；

个人信息共享、转让或公开披露的主要对象发生变化；

您参与个人信息处理方面的权利及其行使方式发生重大变化；

我们负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化；

个人信息安全影响评估报告表明存在高风险时；

在“信迷APP”停止运营时，我们会及时停止继续收集个人信息，可能以注意送达或网站公告的形式通知您停止运营的情况，并对您的个人信息进行删除或匿名化处理。

#### 八、争议解决

我们在中华人民共和国境内运营中收集和产生的个人信息，存储在中国境内，法律法规有明确规定/本用户协议及您与信迷的关系适用于中华人民共和国大陆地区法律，但不包括其冲突法规范。您同意遵从信迷所在地北京市人民法院的司法管辖。

#### 九、如何联系我们

如果您对本隐私政策有任何疑问、意见或建议，通过以下方式与我们电话联系：15216904030（工作日 周一至周五9:00-18:00）。

本版发布日期：2021年【5】月【1】日
生效日期：2021年【6】月【1】日
	`)
	
	export default {
		  components: {
		    uParse
		  },
		data() {
			return {
				content: text
			}
		},
		methods: {
			
		}
	}
</script>

<style>
@import url("@/components/u-parse/u-parse.css");
</style>
